/* 9.Process Credentials */

/*
 Каждый процесс связан с набором числовых идентификаторов пользователя (UID) и группы (GID).
 Эти идентификаторы иногда называют учетными данными процесса.

 К ним относятся:

- реальный идентификатор пользователя и идентификатор группы;
- эффективный идентификатор пользователя и идентификатор группы;
- сохраненный идентификатор пользователя и идентификатор группы;
- идентификатор пользователя и идентификатор группы файловой системы (специфично для Linux);
- вспомогательные идентификаторы групп.

 */